window.addEventListener("load", solve);

function solve() {
  const main = document.getElementById("main-content");
  const routes = Array.from(document.getElementsByClassName("route")).forEach(
    (el) => el.addEventListener("click", changeRoute)
  );

  function changeRoute(ev) {
    const route = ev.target.textContent;

    if (route === "Източни") {
        main.innerHTML = `
              <h1 id="biggestrivers-h1">Две Източни реки в България</h1>
              <div class="river">
              <img src="/recources/images/dunav.png" alt="Дунав">
              <div class="text">
                  <h2>1. Дунав</h2>
                  <p id="river-p">Река Дунав е най-голямата река, която преминава през България. Тя извира от Черния горски крайник в Германия и протича през няколко европейски страни, включително България.
                  Влива се в Черно море и предлага впечатляващи пейзажи и възможности за риболов и рекреация.
                  Реката Дунав има огромно икономическо и културно значение за България, предоставяйки възможности за търговия и транспорт, както и съхранявайки богатство от природни и културни атракции.</p>
              </div>
          </div>
  
        <div class="river">
            <img src="/recources/images/qntra.png" alt="Янтра">
            <div class="text">
                <h2>2. Янтра</h2>
                <p id="river-p">Река Янтра е значима река в Източна България. Тя извира от Стара планина и преминава през градовете Велико Търново, Русе и Свищов.
                Янтра предлага красиви пейзажи и възможности за риболов, рекреация и плуване. Реката е също така известна със своите скали и каньони, които са привлекателни за туристите.</p>
            </div>
        </div>`;
    } else if (route === "Западни") {
        main.innerHTML = `
              <h1 id="biggestrivers-h1">Три Западни реки в България</h1>
              <div class="river">
                <img src="/recources/images/iskar.png" alt="Искър">
                <div class="text">
                    <h2>1. Искър</h2>
                    <p id="river-p">Река Искър е една от най-големите реки в България и протича през Западна част на страната. Извира от Рила планина и преминава през градовете Самоков, София и Мездра, преди да се влива в река Дунав.
                    Искър е известна с красивите си уща и предлага възможности за риболов, рекреация и водни спортове. Реката е също така използвана за производство на хидроелектроенергия.</p>
                </div>
            </div>
  
            <div class="river">
            <img src="/recources/images/ogosta.png" alt="Огоста">
            <div class="text">
                <h2>2. Огоста</h2>
                <p id="river-p">Река Огоста е река, която извира от планината Шар Планина в Западна България. Протича през градовете Монтана и Враца, преди да се влива в река Дунав.
                Огоста предлага красиви пейзажи и е известна със своите каньони и водопади. Реката предоставя възможности за рафтинг, каяк и други водни спортове.</p>
            </div>
        </div>
  
        <div class="river">
        <img src="/recources/images/struma.png" alt="Струма">
        <div class="text">
            <h2>3. Струма</h2>
            <p id="river-p">Река Струма, която вече споменахме като река в Югозападна България, преминава и през Западна България. След като премине през Благоевград, тя продължава своя път към Гърция и се влива в Егейско море.
            Струма е известна с плодородната си долина и предлага възможности за риболов, рафтинг и други водни спортове. Реката играе важна роля в икономиката, осигурявайки вода за земеделие и промишленост.</p>
        </div>
    </div>`;
    } else if (route === "Северни") {
        main.innerHTML = `
              <h1 id="biggestrivers-h1">Три Северни реки в България</h1>
              <div class="river">
                <img src="/recources/images/dunav.png" alt="Дунав">
                <div class="text">
                    <h2>1. Дунав</h2>
                    <p id="river-p">Река Дунав е най-голямата река, която преминава през България. Тя отделя голяма част от северната граница на страната.
                    Дунав е известна със своите красиви пейзажи и предлага възможности за риболов, рекреация и плаване. Множество градове и селища в Северна България се намират в близост до реката Дунав.</p>
                </div>
            </div>
  
            <div class="river">
                <img src="/recources/images/lom.png" alt="Лом">
                <div class="text">
                    <h2>2. Лом</h2>
                    <p id="river-p">Река Лом е река, която преминава през северозападната част на България и влива се в река Дунав.
                    Лом е известна с красивите си пейзажи и предлага възможности за риболов и рекреация. Реката преминава през град Лом, който е известен със своето богато историческо наследство.</p>
                </div>
            </div>
  
            <div class="river">
                <img src="/recources/images/ogosta.png" alt="Огоста">
                <div class="text">
                    <h2>2. Огоста</h2>
                    <p id="river-p">Река Огоста, която вече споменахме като река в Западна България, също преминава през северната част на страната, преди да се влива в река Дунав.
                    Огоста предлага впечатляващи пейзажи, включително каньони и водопади. Реката е подходяща за рафтинг и други водни спортове, а околната природа е привлекателна за туристи и любители на природата.</p>
                </div>
            </div>`;
    } else if (route === "Южни") {
        main.innerHTML = `
              <h1 id="biggestrivers-h1">Три Южни реки в България</h1>
            <div class="river">
            <img src="/recources/images/marica.png" alt="Марица">
                <div class="text">
                    <h2>1. Марица</h2>
                    <p id="river-p">Река Марица е една от най-дългите реки в България и протича през Южна част на страната. Тя извира от Родопите и преминава през градовете Смолян, Пловдив и Хасково, преди да се влива в Егейско море.
                    Марица е важна икономическа артерия, предоставяйки вода за земеделие и промишленост. Реката също така предлага възможности за риболов, плуване и различни видове рекреация.</p>
                </div>
            </div>
  
            <div class="river">
            <img src="/recources/images/arda.png" alt="Арда">
                <div class="text">
                    <h2>2. Арда</h2>
                    <p id="river-p">Река Арда е значима река, която протича през Южна България. Тя извира от Родопите и преминава през градовете Смолян, Кърджали и Хасково.
                    Арда е позната със своите красиви пейзажи, водопади и каньони. Реката предлага възможности за рафтинг, каяк и други водни спортове. Това е идеално място за любители на природата и активния отдих.</p>
                </div>
            </div>
  
            <div class="river">
            <img src="/recources/images/struma.png" alt="Струма">
                <div class="text">
                    <h2>3. Струма</h2>
                    <p id="river-p">Река Струма, която вече споменахме като река в Югозападна България, също преминава и през Южна България. След като премине през Благоевград, тя продължава своя път към Гърция и се влива в Егейско море.
                    Струма е известна с плодородната си долина и предлага възможности за риболов, рафтинг и други водни спортове. Реката играе важна роля в икономиката, осигурявайки вода за земеделие и промишленост.</p>
                </div>
            </div>`;
    } else if (route === "Североизточни") {
      main.innerHTML = `
            <h1 id="biggestrivers-h1">Три Североизточни реки в България</h1>
            <div class="river">
                <img src="/recources/images/dunav.png" alt="Дунав">
                <div class="text">
                    <h2>1. Дунав</h2>
                    <p id="river-p">Река Дунав е един от най-големите и важни реки в Европа. Тя протича през Североизточна България, образувайки граница с Румъния.
                    Дунавът има обща дължина от около 2,857 километра и е вторият по дължина река в Европа, след Волга.
                    В България Дунавът преминава през градовете Русе и Силистра, които са важни исторически и икономически центрове.
                    Реката е изключително важна за търговията и транспорта, като по нея се превозват товари и пътници. Освен това предлага възможности за риболов и рекреация.</p>
                </div>
            </div>

            <div class="river">
                <img src="/recources/images/qntra.png" alt="Янтра">
                <div class="text">
                    <h2>2. Янтра</h2>
                    <p id="river-p">Река Янтра е най-дългата река, изцяло на територията на България. Тя извира от Стара планина и преминава през Северна България.
                    Янтра има дължина от около 368 километра и е значимо водно течение в региона.
                    Реката минава през градовете Велико Търново, Горна Оряховица и Русе, преди да се влива в Дунав.
                    Река Янтра е богата на природни и културни забележителности, като възлага възможности за риболов, каяк и други видове спортове на водата.</p>
                </div>
            </div>

            <div class="river">
                <img src="/recources/images/lom.png" alt="Лом">
                <div class="text">
                    <h2>3. Лом</h2>
                    <p id="river-p">Река Лом е значително водно течение в Североизточна България. Тя извира от планината Леска и преминава през Лом и Монтана.
                    Дължината на река Лом е около 173 километра, като тя също се влива в река Дунав.
                    Реката е важна за региона и предлага възможности за риболов и рекреация, както и за природно разнообразие и екотуризъм.</p>
                </div>
            </div>
            `;
    } else if (route === "Северозападни") {
      main.innerHTML = `
            <h1 id="biggestrivers-h1">Три Северозападни реки в България</h1>
            <div class="river">
                <img src="/recources/images/iskar.png" alt="Искър">
                <div class="text">
                    <h2>1. Искър</h2>
                    <p id="river-p">Река Искър е най-дългата река, изцяло на територията на България. Тя извира от Рила планина и преминава през Западна и Северозападна България.
                    Искър протича през градовете Самоков, Мездра, Божурище и София, преди да се влива в Дунав близо до град Искър.
                    Реката е важен воден ресурс и предоставя възможности за риболов, каяк и други водни спортове, както и за разнообразие от природни и културни забележителности в близост до нея.</p>
                </div>
            </div>
            <div class="river">
                <img src="/recources/images/ogosta.png" alt="Огоста">
                <div class="text">
                    <h2>2. Огоста</h2>
                    <p id="river-p">Река Огоста е значима река в Северозападна България. Тя извира от Люлин планина и преминава през Монтанско, Видинско и Врачанско.
                    Огоста се характеризира с красиви каньони и уникални природни образувания, като Бели лом, Леденика и други.
                    Реката предлага възможности за кану-каяк, риболов и екотуризъм, като привлича любители на природата и приключенията.</p>
                </div>
            </div>
            <div class="river">
                <img src="/recources/images/lomnica.png" alt="Ломница">
                <div class="text">
                    <h2>3. Ломница</h2>
                    <p id="river-p">Река Ломница е река в Северозападна България. Тя извира от Врачанския Балкан и преминава през Враца и околните райони.
                    Ломница е с дължина около 65 километра и е известна с красивата си долина и природни пейзажи.
                    Реката предлага възможности за риболов и екотуризъм, като по поречието й се намират някои интересни места за посещение, включително природен парк "Вражата дупка" и водопад "Леденик".</p>
                </div>
            </div>
            `;
    } else if (route === "Югоизточни") {
      main.innerHTML = `
            <h1 id="biggestrivers-h1">Три Югоизточни реки в България</h1>
            <div class="river">
                <img src="/recources/images/marica.png" alt="Марица">
                <div class="text">
                    <h2>1. Марица</h2>
                    <p id="river-p">Река Марица е една от най-дългите реки, протичащи през България. Тя извира от Родопите и преминава през цялата Южна България, включително градовете Смолян, Пловдив и Хасково.
                    Марица е важен воден ресурс за региона и предоставя възможности за риболов, рекреация и спортни дейности на водата.
                    Реката играе също така важна роля в икономиката, осигурявайки вода за земеделие и промишленост, както и предоставяйки възможности за воден транспорт.</p>
                </div>
            </div>

            <div class="river">
                <img src="/recources/images/arda.png" alt="Арда">
                <div class="text">
                    <h2>2. Арда</h2>
                    <p id="river-p">Река Арда е значима река в Югоизточна България. Тя извира от Родопите и преминава през градовете Кърджали и Хасково, преди да се влива в Марица.
                    Арда е известна с красивите си уща и каньони, както и със своите термални извори. Тя предоставя възможности за риболов, каяк, рафтинг и други водни спортове.
                    Реката Арда има и значително значение за производството на електроенергия, като по нея се намират няколко хидроелектроцентрали.</p>
                </div>
            </div>

            <div class="river">
                <img src="/recources/images/tundja.png" alt="Тунджа">
                <div class="text">
                    <h2>3. Тунджа</h2>
                    <p id="river-p">Река Тунджа е важна река в Югоизточна България. Тя извира от Стара планина и преминава през градовете Казанлък, Ямбол и Сливен, преди да се влива в Марица.
                    Тунджа е известна с плодородната си долина, където се отглеждат различни видове земеделски култури. Реката предоставя възможности за риболов и рекреация.
                    В близост до реката Тунджа се намират някои исторически и културни забележителности, включително Тракийската гробница в Казанлък и град Несебър, които са включени в списъка на ЮНЕСКО за световно културно наследство.</p>
                </div>
            </div>
            `;
    } else if (route === "Югозападни") {
      main.innerHTML = `
            <h1 id="biggestrivers-h1">Три Югозападни реки в България</h1>

            <div class="river">
                <img src="/recources/images/struma.png" alt="Струма">
                <div class="text">
                    <h2>1. Струма</h2>
                    <p id="river-p">Река Струма е значима река в Югозападна България. Тя извира от Верила планина и преминава през градовете Благоевград, Сандански и Кюстендил.
                    Струма е известна с плодородната си долина и предоставя възможности за риболов, рафтинг и други водни спортове.
                    Реката е важен воден ресурс за региона и е използвана за производство на хидроелектроенергия, като по нея се намират няколко хидроцентрали.</p>
                </div>
            </div>

            <div class="river">
                <img src="/recources/images/mesta.png" alt="Места">
                <div class="text">
                    <h2>2. Места</h2>
                    <p id="river-p">Река Места е река в Югозападна България. Тя извира от Пирин планина и преминава през градовете Разлог и Гоце Делчев.
                    Места предлага красиви пейзажи и възможности за риболов и рекреация. Реката преминава през горските местности и предлага спокойна и приятна обстановка за посетители.</p>
                </div>
            </div>

            <div class="river">
                <img src="/recources/images/gruckaStruma.png" alt="Струма (Гръцка Струма)">
                <div class="text">
                    <h2>3. Струма (Гръцка Струма)</h2>
                    <p id="river-p">Гръцка Струма е река, която протича в западната част на Гърция, но е от значение и за Югозападна България.
                    Реката има своето изворище в Родопите, а впада в Егейско море близо до гръцкия град Солун.
                    Гръцка Струма е важен воден път и има влияние върху околната природа и икономиката, предоставяйки възможности за търговия, риболов и рекреация.</p>
                </div>
            </div>`;
    } else if (route === "Информация за сайта") {
      main.innerHTML = `
            <div id="infoPage-contaniner" class="important-info">        
            <span id="span-creators">Участниците в проекта:</span>

                <ul id="creators">   
                    <li>Ивайло Делчев</li>
                    <li>Теодор Костадинов</li>
                    <li>Пламен Христов</li>
                </ul>

                <p id="information-p">
                    Главната информация представена в този сайт е придобита <br> от следователните два сайта:
                </p>

                <div id="site-link">
                    <a id="first-link" href="https://www.wikipedia.org" target="_blank">https://www.wikipedia.org
                </div>

            </div>`;
    } else if (route === "Допълнителна информация") {
      main.innerHTML = `
            <div id="infoPage-contaniner">  
                <h1 id="home-title">Допълнителна информация</h1>

                <ul>
                    <li class="more-info">Река Марица - 
                        <a href="https://www.nasamnatam.com/statia/Marica_nai_pylnovodnata_bylgarska_reka-2456.html" target="_blank">
                            www.nasamnatam.com
                        </a>
                    </li>
                    <li class="more-info">Река Искър - 
                        <a href="https://lakatnik.info/река-искър/" target="_blank">
                            lakatnik.info
                        </a>
                    </li>
                    <li class="more-info">Река Дунав - 
                        <a href="https://bg.wikipedia.org/wiki/Дунав" target="_blank">
                            bg.wikipedia.org
                        </a>
                    </li>
                    <li class="more-info">
                        Река Арда - 
                        <a href="https://bg.wikipedia.org/wiki/Арда" 
                           target="_blank">bg.wikipedia.org
                        </a>
                    </li>
                    <li class="more-info">Река Струма - 
                        <a href="http://www.bg-tourinfo.com/struma.htm"  target="_blank">
                            www.bg-tourinfo.com
                        </a>
                    </li>
                </ul>
            </div>  
            `;
    } else {
      main.innerHTML = `
            <h1 id="home-title">Реки в България</h1>
            <p id="home-description">Из страниците на този сайта, можете да намерите <br> инфорамцаия за множество реки в България.
            </p>
            <img id="river-image" src="/recources/images/river.png" alt="river dam">
            `;
    }
  }
}
